"""
згенерувати матрицю chesboard_pattern

"""

def chesboard_pattern(width, height):
    pass

assert chesboard_pattern(2, 2) == [[0, 1], [1, 0]]
assert chesboard_pattern(4, 3) == [[0, 1, 0, 1], [1, 0, 1, 0], [0, 1, 0, 1]]

"""
Знайти число яке більше 50% елементів списку.
"""

def bigger_then_half(array):
    pass

assert bigger_then_half([1, 2, 3]) == 3# bigger then 2 out of 3
assert bigger_then_half([1, 2, 2, 3]) == 3# bigger then 3 out of 4
assert bigger_then_half([1, 1, 1, 2, 3]) == 2# bigger then 3 out of 5

"""знайти сумму всіх чисел в лісті 

Спойлер:
якщо ви уважно почитали документацію до типу флоат, то можливо умова на тип для вас не така і складна
Якщо ні - if-else.....
"""

def sum_list(array):
    pass

assert sum_list([1, 2, "1"]) == 4
assert type(sum_list([1, 2, "1"])) == int
assert sum_list([1, 2, "1", "1.1"]) == 5.1
assert type(sum_list([1, 2, "1", "1.1"])) == float
assert sum_list([1, 2, "1", "-1.0"]) == 3
assert type(sum_list([1, 2, "1", "-1.0"])) == int

"""
складати і скорочуавти раціональні дроби . 
"""


def divide(a, b):
    pass

assert divide((1, 8), (3, 8)) == (1, 2)#1\8 + 3\8 = 4\8 = 1\2
assert divide((1, 0), (3, 8)) == None#1\0 + 3\8 - not valid

"""
В бескінечному циклі користувач вводить строки. Відповідь чи є строка паліндромом - дорівнює сама собі задом на перед.
Переривається при вводі пустої строки
"""

"""
В бескінечном уциклі ви вводите числа. кожне чьотне число додається до загальної суми. кожне нечьотне віднімається.
при написанні слова end цикл зупиняється і видається сума.

"""

"""
Завантажити з data.json данні та перезаписани їх як вказано в файлах split_format, index_format, column_format

Ускладнений варіант - напишіть ассет до цього завдання самі

"""

"""
Користуючись данними з boxes.csv підрахуйте об'єм  кожної з коробок. та запишіть у csv нову табличку, з новим стопчиком
Порахуйте середній розмір коробки(за 3 вимірами і об'ємом) результат збережіть у json файлі.

Провокаційна задача на *:
Напішіть функцію розрахунку максимальної кількості коробок що можна повністю поставити одна в одну(матрьошкою). 


Увага. подивіться в доки про цсв файл прикріплений до заняття щоб було трошки легше

"""

